[
  {
    "name": "Phil Trotter",
    "title": "Lawyer",
    "bio": [
      "Phil Trotter is the senior lawyer and founder of Karuna Law Office. An immigration lawyer since 2010, he has successfully helped refugees settle in Canada, with greater security, human rights and freedom.",
      "Phil is a member in good standing with the Law Society of Ontario. He has represented refugees and migrants at the Immigration and Refugee Board (IRB), Refugee Protection Division (RPD), Refugee Appeal Division (RAD), Immigration Appeal Division (IAD), Federal Court and Federal Court of Appeal. Phil has also helped many refused refugees and other migrants obtain permanent residence through humanitarian and compassionate applications, and family class sponsorship permanent resident applications.",
      "Phil became a lawyer with the intention to be of service and benefit to people. Phil works with others to get positive results, with ethical efficiency, emphasizing truthfulness and kindness as the best way forward. After obtaining his law degree at McGill University in Montreal, Phil moved to Toronto, where he started his law practice in 2010. Since 2010, he has served and represented refugees from all over the world, helping them resettle with greater security and human rights in Canada. Phil has also been involved in politics, with the aim of contributing to a better world. Since 2019, he has been mostly representing Tibetan Buddhist refugees from India, Nepal, and Bhutan. This accords well with his personal life, since he has been practicing Tibetan Buddhism since 2006."
    ],
    "image": "phil_trotter.jpg",
    "location": "Toronto, CA",
    "socialLinks": {
      "linkedin": "https://www.linkedin.com/in/philtrotter",
      "email": "mailto:phil.trotter@example.com"
    },

    "articles": [
      {
        "title": "Legal status of Tibetans migrants in Canadian refugee law",
        "date": "July 25, 2024",
        "url": "https://www.law360.ca/ca/articles/1861824/legal-status-of-tibetans-migrants-in-canadian-refugee-law",
        "description": "An overview of recent changes to Canadian immigration law and what they mean for applicants."
      }
    ]
  },
  {
    "name": "Rinchen Phuntsok | རིན་ཆེན་ཕུན་ཚོགས་",
    "title": "Lawyer",
    "bio": [
      "Rinchen Phuntsok is a lawyer at Karuna Law Office. Recently called to the Ontario bar, he is the first Tibet-born Canadian lawyer, qualified to practice in both India and Canada. Having personally navigated the immigration process, he brings empathy and understanding to the clients he serves.",
      "Rinchen Phuntsok is a lawyer with a distinctive international legal background. Born in Tibet and trained in India, he earned his Master of Laws (LL.M.) before immigrating to Canada, where he qualified as a lawyer. He is the first Tibet-born Canadian lawyer qualified to practice in more than one jurisdiction — India and Canada — a milestone that reflects his dedication, resilience, and commitment to the legal profession.",
      "He helps clients navigate complex legal processes with clarity, confidence, and care. His personal experience going through immigration and refugee processes in Canada deeply informs his approach, allowing him to guide clients with greater genuine empathy and understanding.",
      "He speaks English, Tibetan, and Hindi, enabling him to communicate with clients from diverse cultural and linguistic backgrounds. He has also completed an Alternative Dispute Resolution (ADR) program in Canada, equipping him to resolve conflicts through mediation and other collaborative methods when appropriate. In India, he worked as a legal advisor for non-profit organizations.",
      "With multicultural roots, international qualifications, and lived experience, he is committed to making legal processes clear, supportive, and as stress-free as possible for every client."
    ],
    "image": "rinchen_phuntsok.jpg",
    "location": "Toronto, CA",
    "socialLinks": {
      "linkedin": "https://www.linkedin.com/in/rinchenphuntsok",
      "email": "mailto:rinchen.philtrotterlaw@gmail.com"
    },
    "articles": []
  }
]
